{"id":4021,"date":"2015-12-22T03:41:52","date_gmt":"2015-12-21T22:11:52","guid":{"rendered":"http:\/\/127.0.0.1\/wordpress\/?p=4021"},"modified":"2017-06-22T15:31:05","modified_gmt":"2017-06-22T10:01:05","slug":"the-journey-towards-a-new-beginning","status":"publish","type":"post","link":"http:\/\/localhost\/wordpress\/index.php\/2015\/12\/22\/the-journey-towards-a-new-beginning\/","title":{"rendered":"The Journey towards a New Beginning"},"content":{"rendered":"<aside class=\"mashsb-container mashsb-main mashsb-stretched\"><div class=\"mashsb-box\"><div class=\"mashsb-count mash-large\" style=\"float:left;\"><div class=\"counts mashsbcount\">120<\/div><span class=\"mashsb-sharetext\">SHARES<\/span><\/div><div class=\"mashsb-buttons\"><a class=\"mashicon-facebook mash-large mash-center mashsb-noshadow\" href=\"https:\/\/www.facebook.com\/sharer.php?u=http%3A%2F%2Flocalhost%2Fwordpress%2Findex.php%2F2015%2F12%2F22%2Fthe-journey-towards-a-new-beginning%2F\" target=\"_top\" rel=\"nofollow\"><span class=\"icon\"><\/span><span class=\"text\">&nbsp;Tell&nbsp;your&nbsp;friends&nbsp;<\/span><\/a><a class=\"mashicon-twitter mash-large mash-center mashsb-noshadow\" href=\"https:\/\/twitter.com\/intent\/tweet?text=&url=http:\/\/localhost\/wordpress\/index.php\/2015\/12\/22\/the-journey-towards-a-new-beginning\/&via=Sourav_Ghosh\" target=\"_top\" rel=\"nofollow\"><span class=\"icon\"><\/span><span class=\"text\">&nbsp;Tweet&nbsp;about&nbsp;this&nbsp;<\/span><\/a><div class=\"onoffswitch2 mash-large mashsb-noshadow\" style=\"display:none;\"><\/div><\/div>\n            <\/div>\n                <div style=\"clear:both;\"><\/div><div class=\"mashsb-toggle-container\"><\/div><\/aside>\n            <!-- Share buttons by mashshare.net - Version: 3.7.7--><blockquote><p>Adapted from my private journal entry on 09th March, 2015.<\/p><\/blockquote>\n<p>Today, I am going to start writing about an experience that has probably never been such intense for me till date. The number of people who actually know how it was is very less. To be frank, perhaps there are only a few people who knows what I went through, and even they don&#8217;t know it entirely. Let me start from the beginning.<!--more--><\/p>\n<p>It was the month of July 2014. By the latter half of the month, it had become quite clear, that I wouldn&#8217;t be joining any IITs or IISc in spite of securing a not-so-modest rank in GATE 2014, and would instead be joining an MNC. There again, I had choices &#8211; TCS or IBM. My mind told me to go for IBM. I didn&#8217;t wish to be seen as just one sheep of a herd. But there again, a part of me suggested TCS, as I reasoned then, it would be the safer option. I also had one more justification for the choice. TCS was more likely to post me at Kolkata which would be helpful if I wish to make another attempt at higher studies in the next year.<\/p>\n<p>I sort of already knew that IBM would call me for its training at Bangalore. What I didn&#8217;t know was when. The company had been quite erratic and unpredictable in dispatching of joining letters, which did add to the cons of the IBM choice.<\/p>\n<p>Anyway, I don&#8217;t remember the day exactly when I got a call from Krishna saying that our TCS joining letters have been dispatched. Oh, and I just remembered: the day was the 2nd of July, and I was expecting the letter on the day. I was having lunch at that time. I quickly finished it and started booting up my desktop. By then, I&#8217;d come to know that few of my friends had been scheduled for TCS Initial Learning Program (ILP) at Ahmedabad and a few others at Hyderabad. I was not quite sure by then which group I wanted to be in &#8211; Hyderabad or Ahmedabad.<\/p>\n<p>A majority of my classmates were scheduled for Ahmedabad but then again my bonding was not quite that great with all of them. Sayani, who has been one of my best friends, was scheduled for Ahmedabad too. But again, Krishanu, Neelakshi and Anuran were going to Hyderabad. Krishanu, Neelakshi and Krishna &#8211; I had yet another level of bonding with them owning to work in TGMC, InspirIT, and the unforgettable trip to Bangalore, Chennai and Puri. <i>(Those are &#8220;stories&#8221; in themselves which I&#8217;ll write down some other time.)<\/i> Dilemma after dilemma!<\/p>\n<p>While I had still not quite made up my mind which one I want for myself, there it was before me. The NextStep portal of TCS promptly displayed the location of my ILP &#8211; TRIVANDRUM, KERALA.<\/p>\n<p>For at least 10-15 seconds, I must have been in a bit of shock. Not because I got scared. Shocks had long stopped scaring me. Instead, I found them amusing. I kind of felt amused at the way my luck kept on putting me in an awkward situation. I&#8217;ll describe that when I talk about why I didn&#8217;t, or rather, couldn&#8217;t join any IIT last year.<\/p>\n<p>I shared the news with my mother, who seemed to already expect such a thing, considering my luck lately. Then, started the phone calls to friends, relatives, and one or two teachers in particular &#8211; Subhamita Ma&#8217;am and Piyal Sir. It also became evident that I was the only one from IT2014 to have been mapped to Trivandrum for ILP during that period. For what was known at that time, no known faces were going to be there at Trivandrum.<\/p>\n<p>The dilemma of TCS or IBM didn&#8217;t quite die out till the day I joined TCS and perhaps even a week after that. But there&#8217;s no point talking about that here. The point is my heart was inclining towards TCS and I decided to listen to my heart.<\/p>\n<p>The next few days went around pretty fast. The schedule was almost the same every day. Making sure whether I have every document ready, transferring files from my desktop to my new laptop, teaching my mother how to operate the desktop, making sure there won&#8217;t be any glitches or issues with the machine, or even if there is, whether I can troubleshoot remotely.<\/p>\n<p>At night, while trying to sleep sometimes I did indeed felt discomfort at the possibility of homesickness after moving to a new city. I had never been away from home this long. Now, I know that it is all in our hearts. Perhaps, we fear the unknown too much. For when I actually moved, I can&#8217;t remember a single instance when I felt homesick. <i>Hope that&#8217;s not weird.<\/i><\/p>\n<p>I tried contacting others who have already joined ILP at Trivandrum using Facebook. Someone shared a few photos of what rooms he has been allocated. I downloaded them and tried to imagine how it would be to live in them. I soon built up images of my probable roommates, how&#8217;d they be like, how we&#8217;ll adjust together, what activities we&#8217;ll do, etc. One particular concern was food. As far as I had known, South Indians use coconut oil to cook food and I, being a Bengali, was accustomed to fishes and rice, all cooked in mustard oil. And the memories of curry patta, sour curd and fiery chicken from my trip to Bangalore and Chennai had not quite left yet. It seemed home delivery or office canteen were the only feasible options.<\/p>\n<p>I met one particular guy on Facebook who commented on my post where I&#8217;d asked people who were heading to Trivandrum to comment. His name was Srijan Gupta. But he did not have his picture as his profile picture. Instead, there was Harry Potter on a broom, casting some spell and yelling. He was a Bengali and from Kalyani Government Engineering College. Little did I know what was awaiting me at Trivandrum back then. Nor did I have any idea about the interactions I&#8217;d be having with Srijan; not only at Trivandrum but after getting back here at Kolkata.<\/p>\n<p>So, Srijan told me that around 15 male students from his college were coming to Trivandrum. All of them were Bengalis and so I felt it wouldn&#8217;t be much of an issue to find North Indian food or something that works well with our digestive system, used to Bengali food. I also told Srijan to let me know if they have room for any extra person, in which case, I&#8217;d move in with them as roommates. That settlement didn&#8217;t play out eventually as later I came to know that two other students from my own college were also heading for Trivandrum &#8211; Saikat Sengupta from ECE and Naveen Pandey from CSE. I knew Naveen a bit, and Saikat was a Bengali with whom I sort of felt quite connected as our tastes and biases matched about the whole Trivandrum idea. Coincidentally, it turned out that both of them had also booked flight tickets on the same flight as me &#8211; Indigo 6E-377.<\/p>\n<p>I&#8217;ll skip some of the details. But on my last evening at Kolkata, I remember that my airtel 4G dongle got activated after phone verification. Suman and my 3 <i>mami<\/i>s (maternal aunts) had come to visit me. Also, a few friends paid a visit. One in particular apparently didn&#8217;t wish to come as she was &#8220;angry because I hadn&#8217;t visited their residence in a long time&#8221;. After the last moment checks whether I had copied everything from desktop to laptop and secured sensitive files on the desktop from accidental deletion, I shut it down ceremoniously. <i>Yes, I do these kinds of weird acts at times.<\/i><\/p>\n<p>Neither I nor my parents had a minute of sleep that night. My flight was scheduled early in the morning at around 5-6. We left for the airport roughly around 3:30-4:00. It didn&#8217;t take long on a shuttle car. I waited there for Saikat who was supposed to arrive in a few minutes with his parents. I met him for the first time outside the airport after having taken a few selfies with my parents.<\/p>\n<p>And then, saying goodbye to our parents, Saikat and I went inside and went ahead to collect the boarding pass. Naveen could not be reached over phone for a while and when we got in touch with him, he said he will reach in 15-20 minutes. So, the two of us decided to complete our check-in and baggage checks. Both of us were a bit nervous about whether we were exceeding the luggage weight limit. We placed both of our cabin luggage on the weighing tray, and the lady over the counter said it was 12 kg more than permitted free baggage. At that moment, I perhaps didn&#8217;t quite do the calculations but proposed weighing both separately. I brought my baggage down from the tray, and again the lady repeated &#8220;Exceeding by 12 kg&#8221;. So, Saikat&#8217;s bag alone had exceeded his 15 kg limit by 12 kg! I recalled that my baggage was weighed in advance to exactly reach around 15 kg.<\/p>\n<p>Saikat asked me for INR 1000 in cash, saying he&#8217;d return in a few minutes once we are at the waiting lounge in front of the boarding gates.  The security checks went smoothly and soon we were waiting at the lounge. While I was trying to check whether I could access any free WiFi hotspots and then switching to mobile data traffic, failing to locate a good connection, we were joined by Naveen. Saikat and I had got adjoining seats with one beside the window. Naveen was at a bit distance. He too had got a window seat. Just before boarding, Naveen realised that the security official had forgotten to stamp his tag. And so, he ran back and returned. We got on board our flight 6E-377 and got settled down at our seats.<\/p>\n<p>I made a call to my father informing him that we had got on board and then on the signal of the captain, put my phone in airplane mode. It was my turn at the window seat, and I was experiencing my first take-off. For around two hours, the aeroplane remained on air before proceeding to land at Bangalore where a 30-minute layover was scheduled. I had probably got myself a Health Bar and some snacks in the meantime. At Bangalore, I swapped seats with Saikat. As the flight took off again, we left from the reddish soil of Bengaluru Airport to be welcomed by the green landscape of Kerala with the Arabian Sea by its side. The airport itself seemed quite barren, unlike what we could ever expect to see at Netaji Subhash International Airport at Kolkata.<\/p>\n<p>After collecting the luggage, began the stories of our 3 months of amusements due to us not being able to remotely comprehend the local language, Malayalam. Luckily, as we would find out later, English was quite prevalent and Hindi was also understood by a few people to some extent. It started when we booked a prepaid taxi to reach our accommodation arranged by TCS. Not being sure of the pronunciation, we handed over the address on a mobile phone screen and soon we were escorted to our taxi. We found out that unlike Kolkata, in spite of the name being &#8220;PREpaid&#8221;, you don&#8217;t actually pay anything in advance. You need to pay the driver in cash once you reach the destination. <i>We never asked if they accepted cheques, but my bet is they don&#8217;t.<\/i><\/p>\n<p>Our bags were tied up over the taxi&#8217;s ceiling with ropes tied all around the vehicle. We got in the cab, and then the driver asked again for the address. Naveen gave a blank expression and asked, <i>&#8220;Isn&#8217;t it printed there on the receipt?&#8221;<\/i>. Thankfully, it was and the driver drove off. In a minute, we were on a road beside the ocean. It was a bit weird. It failed me why an airport would be constructed just beside an ocean. Is it helpful for take-offs? Who knows!<\/p>\n<p>Gradually, the roads became shorter, the number of trees kept on increasing and soon we found ourselves in the middle of a village, Kazhakuttom. Scarlet Circle was the name of the region where our Althena complex by Confident Group was situated. Once we reached the gates and paid off the driver, the security personnel told us to head for &#8220;The Office&#8221; inside Sirius complex. Sirius and Althena were two housing complexes built and promoted by the Confident group. The Office turned out to be a 2 storeyed villa. There, a person named &#8220;Babu&#8221; told us the usual rules and regulations. Turned out, the restrictions as previously heard about TCS hostels did not apply to us. They only applied to those who would stay at the Executive Hostel which was a stone&#8217;s throw from the office.<\/p>\n<p>We checked in and completed the formalities. There would be six in each 3BHK apartments and so the 3 of us checked into ORCHID-307, to be joined by 3 other people. While noting the phone numbers for home delivery, I found out that two of these 3 were conversing in Bengali. I asked them their names and where they are from and introduced ourselves. They were Kaushik and Bibashwata (nicknamed Rony).<\/p>\n<p>So it turned out that there would be 4 Bengalis in our apartment and Naveen although not a Bengali but having stayed in Bengal could easily understand Bengali. Only Akhil who was from Delhi was from outside West Bengal.<\/p>\n<p>The six of us were then escorted by a person called &#8220;Gopal&#8221; to our apartment. As we walked towards the elevator of the 20-storeyed building, surrounded by a few other lookalikes, children&#8217;s playground, and arrays of car-parking space, we knew we were in for a treat at the accommodation.<\/p>\n<p><em>(To be continued&#8230;)<\/em><\/p>\n<p><strong><em>[UPDATE (22 Dec, 2015): Follow-up posted as <a href=\"http:\/\/127.0.0.1\/wordpress\/index.php\/2015\/12\/22\/our-luxurious-abode-orchid-307\/\">Our Luxurious Abode &#8211; Orchid 307<\/a>]<\/em><\/strong><\/p>\n<aside class=\"mashsb-container mashsb-main mashsb-stretched\"><div class=\"mashsb-box\"><div class=\"mashsb-count mash-large\" style=\"float:left;\"><div class=\"counts mashsbcount\">120<\/div><span class=\"mashsb-sharetext\">SHARES<\/span><\/div><div class=\"mashsb-buttons\"><a class=\"mashicon-facebook mash-large mash-center mashsb-noshadow\" href=\"https:\/\/www.facebook.com\/sharer.php?u=http%3A%2F%2Flocalhost%2Fwordpress%2Findex.php%2F2015%2F12%2F22%2Fthe-journey-towards-a-new-beginning%2F\" target=\"_top\" rel=\"nofollow\"><span class=\"icon\"><\/span><span class=\"text\">&nbsp;Tell&nbsp;your&nbsp;friends&nbsp;<\/span><\/a><a class=\"mashicon-twitter mash-large mash-center mashsb-noshadow\" href=\"https:\/\/twitter.com\/intent\/tweet?text=&url=http:\/\/localhost\/wordpress\/index.php\/2015\/12\/22\/the-journey-towards-a-new-beginning\/&via=Sourav_Ghosh\" target=\"_top\" rel=\"nofollow\"><span class=\"icon\"><\/span><span class=\"text\">&nbsp;Tweet&nbsp;about&nbsp;this&nbsp;<\/span><\/a><div class=\"onoffswitch2 mash-large mashsb-noshadow\" style=\"display:none;\"><\/div><\/div>\n            <\/div>\n                <div style=\"clear:both;\"><\/div><div class=\"mashsb-toggle-container\"><\/div><\/aside>\n            <!-- Share buttons by mashshare.net - Version: 3.7.7-->","protected":false},"excerpt":{"rendered":"<p>Adapted from my private journal entry on 09th March, 2015. Today, I am going to start writing about an experience that has probably never been such intense for me till date. The number of people who actually know how it was is very less. To be frank, perhaps there are only a few people who &hellip; <\/p>\n<p class=\"link-more\"><a href=\"http:\/\/localhost\/wordpress\/index.php\/2015\/12\/22\/the-journey-towards-a-new-beginning\/\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;The Journey towards a New Beginning&#8221;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4071,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[571],"tags":[581,601,591],"_links":{"self":[{"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/posts\/4021"}],"collection":[{"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/comments?post=4021"}],"version-history":[{"count":10,"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/posts\/4021\/revisions"}],"predecessor-version":[{"id":6611,"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/posts\/4021\/revisions\/6611"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/media\/4071"}],"wp:attachment":[{"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/media?parent=4021"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/categories?post=4021"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/wordpress\/index.php\/wp-json\/wp\/v2\/tags?post=4021"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}